## Final Project Part - II

### In this part, we will be creating tables and loading data into the tables using the ERD in Part - I.

In this project, we will explore Chicago Crime Dataset and implement a relational database for storing the data. During the final week, you will complete Tasks 3-5:

1. Identify the features (attributes) in Chicago Crime dataset and design an entity-relationship model
2. Refine the model and convert each relation to BCNF (if required)
3. Using DDL implement the relations in a Postgres server
4. Load the given data to the relations
5. Execute some interesting queries on the relations

## 2.1 Using DDL, create each of the relations in the postgres server. 

* Use the ERD from Module 7 to create tables (DDL).
* Add additional cells if required.
* Make sure you have good documentation for each table to explain what attributes are and anything that are worth noting.

In [3]:
import getpass
mypasswd = getpass.getpass()

········

In [4]:
# Then connects to the DB
from sqlalchemy.engine.url import URL
from sqlalchemy import create_engine
# -------------- Add Content Below
import psycopg2
import numpy as np
from psycopg2.extensions import adapt, register_adapter, AsIs
# SQLAlchemy Connection Parameters
connection = psycopg2.connect(database = 'dsa_student',
user = 'myqg3',
host = 'pgsql.dsa.lan',
password = mypasswd)

cursor = connection.cursor()

In [5]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS myqg3.crime_code(
iucr VARCHAR(50) NOT NULL,
fbi_code VARCHAR(50) NOT NULL,
description VARCHAR(50),
primary_type VARCHAR(50),
PRIMARY KEY (iucr,fbi_code)
);"""
cursor.execute(sqlCreateTable)
connection.commit()

In [6]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS myqg3.location_area(
la_id INT NOT NULL PRIMARY KEY,
beat INT,
district INT,
ward INT,
community_area INT
);"""
cursor.execute(sqlCreateTable)
connection.commit()

In [7]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS myqg3.location_block(
lb_id INT NOT NULL PRIMARY KEY,
block VARCHAR(150)
);"""
cursor.execute(sqlCreateTable)
connection.commit()

In [8]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS myqg3.location_description(
ld_id INT NOT NULL PRIMARY KEY,
location_description VARCHAR(50)
);"""
cursor.execute(sqlCreateTable)
connection.commit()

In [9]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS myqg3.location_coordinate(
lc_id INT NOT NULL PRIMARY KEY,
x_coordinate INT,
y_coordinate INT,
latitude FLOAT,
longitude FLOAT,
location VARCHAR(50)
);"""
cursor.execute(sqlCreateTable)
connection.commit()

In [10]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS myqg3.crime_location(
cl_id INT NOT NULL PRIMARY KEY,
la_id INT,
lb_id INT,
lc_id INT,
ld_id INT,
FOREIGN KEY (la_id)
    REFERENCES location_area(la_id),
FOREIGN KEY (lb_id)
    REFERENCES location_block(lb_id),
FOREIGN KEY (lc_id)
    REFERENCES location_coordinate(lc_id),
FOREIGN KEY (ld_id)
    REFERENCES location_description(ld_id)
);"""
cursor.execute(sqlCreateTable)
connection.commit()

In [11]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS myqg3.crime_record(
id INT NOT NULL PRIMARY KEY,
iucr VARCHAR(50),
fbi_code VARCHAR(50),
cl_id INT,
unnamed_id INT,
case_number VARCHAR(50),
arrest VARCHAR(10),
domestic VARCHAR(10),
crime_date TIMESTAMP,
year INT,
updated_on TIMESTAMP,
CONSTRAINT crime_code_pkey
FOREIGN KEY (iucr,fbi_code)
    REFERENCES crime_code(iucr,fbi_code),
FOREIGN KEY (cl_id)
    REFERENCES crime_location(cl_id)
);"""
cursor.execute(sqlCreateTable)
connection.commit()

In [24]:
import pandas as pd
import numpy as np

df = pd.read_csv("Chicago-Crime-Sample--2012.csv")
df.head()

,Unnamed: 0,ID,Case Number,Date,Block,IUCR,Primary Type,Description,Location Description,Arrest,...,Ward,Community Area,FBI Code,X Coordinate,Y Coordinate,Year,Updated On,Latitude,Longitude,Location
0,47398,10433096,HZ170962,01-01-2012 00:00,026XX N MC VICKER AVE,1562,SEX OFFENSE,AGG CRIMINAL SEXUAL ABUSE,RESIDENCE,True,...,29.0,19.0,17,1135617,1916918,2012,04-02-2016 06:33,41.928203,-87.777079,"(41.928202943, -87.777079437)"
1,47420,10433124,HZ170983,01-01-2012 00:00,026XX N MC VICKER AVE,1544,SEX OFFENSE,SEXUAL EXPLOITATION OF A CHILD,RESIDENCE,True,...,29.0,19.0,17,1135617,1916918,2012,04-02-2016 06:33,41.928203,-87.777079,"(41.928202943, -87.777079437)"
2,802910,10532867,HZ276514,01-01-2012 00:00,036XX S RHODES AVE,1563,SEX OFFENSE,CRIMINAL SEXUAL ABUSE,APARTMENT,False,...,4.0,35.0,17,1180179,1881011,2012,04-02-2016 06:33,41.828762,-87.614436,"(41.828762287, -87.614436164)"
3,803605,10536876,HZ280873,01-01-2012 00:00,062XX S ROCKWELL ST,1153,DECEPTIVE PRACTICE,FINANCIAL IDENTITY THEFT OVER $ 300,RESIDENCE,False,...,15.0,66.0,11,1160111,1863230,2012,04-02-2016 06:33,41.780406,-87.639933,"(41.774357248, -87.639932837)"
4,831733,9581929,HX232501,01-01-2012 00:00,006XX W 66TH ST,1563,SEX OFFENSE,CRIMINAL SEXUAL ABUSE,RESIDENCE,False,...,6.0,68.0,17,1173390,1861129,2012,04-02-2016 06:33,41.774357,-87.639933,"(41.774357248, -87.639932837)"

In [25]:
df1 = df.copy()
df1.head()

,Unnamed: 0,ID,Case Number,Date,Block,IUCR,Primary Type,Description,Location Description,Arrest,...,Ward,Community Area,FBI Code,X Coordinate,Y Coordinate,Year,Updated On,Latitude,Longitude,Location
0,47398,10433096,HZ170962,01-01-2012 00:00,026XX N MC VICKER AVE,1562,SEX OFFENSE,AGG CRIMINAL SEXUAL ABUSE,RESIDENCE,True,...,29.0,19.0,17,1135617,1916918,2012,04-02-2016 06:33,41.928203,-87.777079,"(41.928202943, -87.777079437)"
1,47420,10433124,HZ170983,01-01-2012 00:00,026XX N MC VICKER AVE,1544,SEX OFFENSE,SEXUAL EXPLOITATION OF A CHILD,RESIDENCE,True,...,29.0,19.0,17,1135617,1916918,2012,04-02-2016 06:33,41.928203,-87.777079,"(41.928202943, -87.777079437)"
2,802910,10532867,HZ276514,01-01-2012 00:00,036XX S RHODES AVE,1563,SEX OFFENSE,CRIMINAL SEXUAL ABUSE,APARTMENT,False,...,4.0,35.0,17,1180179,1881011,2012,04-02-2016 06:33,41.828762,-87.614436,"(41.828762287, -87.614436164)"
3,803605,10536876,HZ280873,01-01-2012 00:00,062XX S ROCKWELL ST,1153,DECEPTIVE PRACTICE,FINANCIAL IDENTITY THEFT OVER $ 300,RESIDENCE,False,...,15.0,66.0,11,1160111,1863230,2012,04-02-2016 06:33,41.780406,-87.639933,"(41.774357248, -87.639932837)"
4,831733,9581929,HX232501,01-01-2012 00:00,006XX W 66TH ST,1563,SEX OFFENSE,CRIMINAL SEXUAL ABUSE,RESIDENCE,False,...,6.0,68.0,17,1173390,1861129,2012,04-02-2016 06:33,41.774357,-87.639933,"(41.774357248, -87.639932837)"

In [26]:
df1['Ward'] = df1['Ward'].fillna(0)
df1['Community Area'] = df1['Community Area'].fillna(0)
df1 = df1.astype({"Ward":int,"Community Area":int})
df1 = df1.astype({"X Coordinate": int, "Y Coordinate": int})

In [27]:
block = pd.DataFrame(df1.iloc[:,4])
block.drop_duplicates(subset='Block',inplace=True)
block.insert(0,'lb_id',range(1,1+len(block)))

In [28]:
block.tail()

        lb_id                 Block
334257  28336     032XX S GILES AVE
334288  28337      007XX E 130TH ST
334631  28338     010XX N HOOKER ST
334654  28339     029XX W FARGO AVE
334701  28340  052XX S LECLAIRE AVE

In [29]:
location_description = pd.DataFrame(df1.iloc[:,8])
location_description.drop_duplicates(subset='Location Description',inplace=True)
location_description.insert(0,'ld_id',range(1,1+len(location_description)))

In [30]:
location_description.tail()

        ld_id                          Location Description
29462      94                               FOREST PRESERVE
51354      95  AIRPORT TERMINAL MEZZANINE - NON-SECURE AREA
75214      96                                  CREDIT UNION
82396      97                               BOAT/WATERCRAFT
111658     98                                     NEWSSTAND

In [32]:
location_coordinates = pd.DataFrame(df1.iloc[:,[16,17,20,21,22]])
location_coordinates.drop_duplicates(subset=['X Coordinate','Y Coordinate','Latitude','Longitude','Location'],inplace=True)
location_coordinates.dropna(inplace=True)
location_coordinates.insert(0,'lc_id',range(1,1+len(location_coordinates)))

In [33]:
location_coordinates.tail()

,lc_id,X Coordinate,Y Coordinate,Latitude,Longitude,Location
334701,162282,1143245,1869532,41.798030,-87.750232,"(41.79803032, -87.750231573)"
334702,162283,1161592,1921231,41.939536,-87.681510,"(41.939536003, -87.681509746)"
334706,162284,1150342,1914710,41.921869,-87.723028,"(41.921869111, -87.723027572)"
334709,162285,1169209,1858007,41.765882,-87.655350,"(41.76588157, -87.655349847)"
334714,162286,1128745,1924002,41.947762,-87.802171,"(41.947761848, -87.802170774)"

In [34]:
df1 = pd.merge(df1, block, on="Block")

In [35]:
df1 = pd.merge(df1, location_description, on="Location Description")
df1 = pd.merge(df1, location_area, on=['Beat','District','Ward','Community Area'])
df1 = pd.merge(df1, location_coordinates, on=['X Coordinate','Y Coordinate','Latitude','Longitude','Location'])

In [36]:
crime_location = pd.DataFrame(df1.iloc[:,[-1,-2,-3,-4]])
crime_location.head()

   lc_id  la_id  ld_id  lb_id
0      1      1      1      1
1      1      1      1      1
2      1      1      1      1
3  83698      1      1      1
4  83698      1      1      1

In [37]:
crime_location.drop_duplicates(subset=['lc_id','la_id','ld_id','lb_id'],inplace=True)
crime_location.insert(0,'cl_id',range(1,1+len(crime_location)))
crime_location.tail()

         cl_id   lc_id  la_id  ld_id  lb_id
334710  243412  139771    713     58  27466
334711  243413  136769    713     63  27341
334712  243414  155469    713     85  28099
334713  243415    4733    716     62   4046
334714  243416   12202    793     62   6574

In [38]:
crime_location = crime_location[['cl_id','la_id','lb_id','lc_id','ld_id']]

In [39]:
crime_location.tail()

         cl_id  la_id  lb_id   lc_id  ld_id
334710  243412    713  27466  139771     58
334711  243413    713  27341  136769     63
334712  243414    713  28099  155469     85
334713  243415    716   4046    4733     62
334714  243416    793   6574   12202     62

In [40]:
df1 = pd.merge(df1, crime_location, on=['lc_id','la_id','ld_id','lb_id'])

In [41]:
df1.columns

Index(['Unnamed: 0', 'ID', 'Case Number', 'Date', 'Block', 'IUCR',
       'Primary Type', 'Description', 'Location Description', 'Arrest',
       'Domestic', 'Beat', 'District', 'Ward', 'Community Area', 'FBI Code',
       'X Coordinate', 'Y Coordinate', 'Year', 'Updated On', 'Latitude',
       'Longitude', 'Location', 'lb_id', 'ld_id', 'la_id', 'lc_id', 'cl_id'],
      dtype='object')

In [42]:
crime_code = pd.DataFrame(df1.iloc[:,[5,15,6,7]])
crime_code.tail()

        IUCR FBI Code        Primary Type              Description
334710   820        6               THEFT           $500 AND UNDER
334711   820        6               THEFT           $500 AND UNDER
334712  1121       10  DECEPTIVE PRACTICE  COUNTERFEITING DOCUMENT
334713   810        6               THEFT                OVER $500
334714   810        6               THEFT                OVER $500

In [43]:
crime_code.drop_duplicates(subset=['IUCR','FBI Code'],inplace=True)
crime_code.tail()

        IUCR FBI Code          Primary Type                     Description
310562  2019       18             NARCOTICS  MANU/DELIVER:HEROIN(BLACK TAR)
324200   142      01B              HOMICIDE               RECKLESS HOMICIDE
330048  2240       22  LIQUOR LAW VIOLATION          MINOR MISREPRESENT AGE
331018  4860       26         OTHER OFFENSE         BOARD PLANE WITH WEAPON
332826  1335       26     CRIMINAL TRESPASS                      TO AIRPORT

In [44]:
crime_record = pd.DataFrame(df1.iloc[:,[1,5,15,-1,0,2,9,10,3,18,19]])
crime_record.head()

,ID,IUCR,FBI Code,cl_id,Unnamed: 0,Case Number,Arrest,Domestic,Date,Year,Updated On
0,10433096,1562,17,1,47398,HZ170962,True,False,01-01-2012 00:00,2012,04-02-2016 06:33
1,10433124,1544,17,1,47420,HZ170983,True,False,01-01-2012 00:00,2012,04-02-2016 06:33
2,8539915,890,6,1,2481315,HV216276,False,False,23-03-2012 14:00,2012,04-02-2016 06:33
3,8638377,486,08B,2,2542746,HV312790,False,True,31-05-2012 20:35,2012,04-02-2016 06:33
4,8641074,560,08A,2,2544718,HV315993,False,True,02-06-2012 22:45,2012,04-02-2016 06:33

In [45]:
crime_record.rename(columns={"Unnamed: 0":"Unnamed_id"},inplace=True)

In [46]:
crime_record['Date'] = pd.to_datetime(crime_record['Date'])

In [47]:
crime_record['Updated On'] = pd.to_datetime(crime_record['Updated On'])

In [48]:
crime_record.head()

,ID,IUCR,FBI Code,cl_id,Unnamed_id,Case Number,Arrest,Domestic,Date,Year,Updated On
0,10433096,1562,17,1,47398,HZ170962,True,False,2012-01-01 00:00:00,2012,2016-04-02 06:33:00
1,10433124,1544,17,1,47420,HZ170983,True,False,2012-01-01 00:00:00,2012,2016-04-02 06:33:00
2,8539915,890,6,1,2481315,HV216276,False,False,2012-03-23 14:00:00,2012,2016-04-02 06:33:00
3,8638377,486,08B,2,2542746,HV312790,False,True,2012-05-31 20:35:00,2012,2016-04-02 06:33:00
4,8641074,560,08A,2,2544718,HV315993,False,True,2012-02-06 22:45:00,2012,2016-04-02 06:33:00

In [50]:
print(list(block))
s = ''
for i in list(block):
    s+= '%s,'
print(s)

['lb_id', 'Block']
%s,%s,

In [51]:
import numpy as np
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)
music_info = block.where(pd.notnull(block), None)
INSERT_SQL = 'INSERT INTO myqg3.location_block'
INSERT_SQL += ' (lb_id,Block) VALUES'
INSERT_SQL += '(%s, %s)'
print(INSERT_SQL)
with connection, connection.cursor() as cursor:
    for row in block.itertuples(index = False, name = None):
        cursor.execute(INSERT_SQL, row)

INSERT INTO myqg3.location_block (lb_id,Block) VALUES(%s, %s)

In [52]:
print(list(location_area))
s = ''
for i in list(location_area):
    s+= '%s,'
print(s)

['la_id', 'Beat', 'District', 'Ward', 'Community Area']
%s,%s,%s,%s,%s,

In [53]:
import numpy as np
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)
music_info = location_area.where(pd.notnull(location_area), None)
INSERT_SQL = 'INSERT INTO myqg3.location_area'
INSERT_SQL += ' (la_id, beat, district, ward, community_area) VALUES'
INSERT_SQL += '(%s,%s,%s,%s,%s)'
print(INSERT_SQL)
with connection, connection.cursor() as cursor:
    for row in location_area.itertuples(index = False, name = None):
        cursor.execute(INSERT_SQL, row)

INSERT INTO myqg3.location_area (la_id, beat, district, ward, community_area) VALUES(%s,%s,%s,%s,%s)

In [54]:
print(list(location_coordinates))
s = ''
for i in list(location_coordinates):
    s+= '%s,'
print(s)

['lc_id', 'X Coordinate', 'Y Coordinate', 'Latitude', 'Longitude', 'Location']
%s,%s,%s,%s,%s,%s,

In [55]:
import numpy as np
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)
music_info = location_coordinates.where(pd.notnull(location_coordinates), None)
INSERT_SQL = 'INSERT INTO myqg3.location_coordinate'
INSERT_SQL += ' (lc_id, x_coordinate, y_coordinate, latitude, longitude, location) VALUES'
INSERT_SQL += '(%s,%s,%s,%s,%s,%s)'
print(INSERT_SQL)
with connection, connection.cursor() as cursor:
    for row in location_coordinates.itertuples(index = False, name = None):
        cursor.execute(INSERT_SQL, row)

INSERT INTO myqg3.location_coordinate (lc_id, x_coordinate, y_coordinate, latitude, longitude, location) VALUES(%s,%s,%s,%s,%s,%s)

In [56]:
print(list(location_description))
s = ''
for i in list(location_description):
    s+= '%s,'
print(s)

['ld_id', 'Location Description']
%s,%s,

In [57]:
import numpy as np
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)
music_info = location_description.where(pd.notnull(location_description), None)
INSERT_SQL = 'INSERT INTO myqg3.location_description'
INSERT_SQL += ' (ld_id, location_description) VALUES'
INSERT_SQL += '(%s,%s)'
print(INSERT_SQL)
with connection, connection.cursor() as cursor:
    for row in location_description.itertuples(index = False, name = None):
        cursor.execute(INSERT_SQL, row)

INSERT INTO myqg3.location_description (ld_id, location_description) VALUES(%s,%s)

In [58]:
print(list(crime_location))
s = ''
for i in list(crime_location):
    s+= '%s,'
print(s)

['cl_id', 'la_id', 'lb_id', 'lc_id', 'ld_id']
%s,%s,%s,%s,%s,

In [59]:
import numpy as np
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)
music_info = crime_location.where(pd.notnull(crime_location), None)
INSERT_SQL = 'INSERT INTO myqg3.crime_location'
INSERT_SQL += ' (cl_id, la_id, lb_id, lc_id, ld_id) VALUES'
INSERT_SQL += '(%s,%s,%s,%s,%s)'
print(INSERT_SQL)
with connection, connection.cursor() as cursor:
    for row in crime_location.itertuples(index = False, name = None):
        cursor.execute(INSERT_SQL, row)

INSERT INTO myqg3.crime_location (cl_id, la_id, lb_id, lc_id, ld_id) VALUES(%s,%s,%s,%s,%s)

In [60]:
print(list(crime_code))
s = ''
for i in list(crime_code):
    s+= '%s,'
print(s)

['IUCR', 'FBI Code', 'Primary Type', 'Description']
%s,%s,%s,%s,

In [62]:
import numpy as np
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)
music_info = crime_code.where(pd.notnull(crime_code), None)
INSERT_SQL = 'INSERT INTO myqg3.crime_code'
INSERT_SQL += ' (iucr, fbi_code, primary_type, description) VALUES'
INSERT_SQL += '(%s,%s,%s,%s)'
print(INSERT_SQL)
with connection, connection.cursor() as cursor:
    for row in crime_code.itertuples(index = False, name = None):
        cursor.execute(INSERT_SQL, row)

INSERT INTO myqg3.crime_code (iucr, fbi_code, primary_type, description) VALUES(%s,%s,%s,%s)

In [63]:
print(list(crime_record))
s = ''
for i in list(crime_record):
    s+= '%s,'
print(s)

['ID', 'IUCR', 'FBI Code', 'cl_id', 'Unnamed_id', 'Case Number', 'Arrest', 'Domestic', 'Date', 'Year', 'Updated On']
%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,

In [64]:
import numpy as np
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)
music_info = crime_record.where(pd.notnull(crime_record), None)
INSERT_SQL = 'INSERT INTO myqg3.crime_record'
INSERT_SQL += ' (id, iucr, fbi_code, cl_id, unnamed_id, case_number, arrest, domestic, crime_date, year, updated_on) VALUES'
INSERT_SQL += '(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)'
print(INSERT_SQL)
with connection, connection.cursor() as cursor:
    for row in crime_record.itertuples(index = False, name = None):
        cursor.execute(INSERT_SQL, row)

INSERT INTO myqg3.crime_record (id, iucr, fbi_code, cl_id, unnamed_id, case_number, arrest, domestic, crime_date, year, updated_on) VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)

## 2.2 Show the table's definition for each table using psql or querying the information_schema.colums catalog

* Add additional cells if required

In [ ]:
dsa_student=> \d crime_code
                       Table "myqg3.crime_code"
    Column    |         Type          | Collation | Nullable | Default
--------------+-----------------------+-----------+----------+---------
 iucr         | character varying(50) |           | not null |
 fbi_code     | character varying(50) |           | not null |
 description  | character varying(50) |           |          |
 primary_type | character varying(50) |           |          |
Indexes:
    "crime_code_pkey" PRIMARY KEY, btree (iucr, fbi_code)
Referenced by:
    TABLE "crime_record" CONSTRAINT "crime_code_pkey" FOREIGN KEY (iucr, fbi_code) REFERENCES crime_code(iucr, fbi_code)

In [ ]:
dsa_student=> \d location_area
                Table "myqg3.location_area"
     Column     |  Type   | Collation | Nullable | Default
----------------+---------+-----------+----------+---------
 la_id          | integer |           | not null |
 beat           | integer |           |          |
 district       | integer |           |          |
 ward           | integer |           |          |
 community_area | integer |           |          |
Indexes:
    "location_area_pkey" PRIMARY KEY, btree (la_id)
Referenced by:
    TABLE "crime_location" CONSTRAINT "crime_location_la_id_fkey" FOREIGN KEY (la_id) REFERENCES location_area(la_id)

In [ ]:
dsa_student=> \d location_block
                   Table "myqg3.location_block"
 Column |          Type          | Collation | Nullable | Default
--------+------------------------+-----------+----------+---------
 lb_id  | integer                |           | not null |
 block  | character varying(150) |           |          |
Indexes:
    "location_block_pkey" PRIMARY KEY, btree (lb_id)
Referenced by:
    TABLE "crime_location" CONSTRAINT "crime_location_lb_id_fkey" FOREIGN KEY (lb_id) REFERENCES location_block(lb_id)

In [ ]:
dsa_student=> \d location_area
                Table "myqg3.location_area"
     Column     |  Type   | Collation | Nullable | Default
----------------+---------+-----------+----------+---------
 la_id          | integer |           | not null |
 beat           | integer |           |          |
 district       | integer |           |          |
 ward           | integer |           |          |
 community_area | integer |           |          |
Indexes:
    "location_area_pkey" PRIMARY KEY, btree (la_id)
Referenced by:
    TABLE "crime_location" CONSTRAINT "crime_location_la_id_fkey" FOREIGN KEY (la_id) REFERENCES location_area(la_id)

In [ ]:
dsa_student=> \d location_coordinate
                   Table "myqg3.location_coordinate"
    Column    |         Type          | Collation | Nullable | Default
--------------+-----------------------+-----------+----------+---------
 lc_id        | integer               |           | not null |
 x_coordinate | integer               |           |          |
 y_coordinate | integer               |           |          |
 latitude     | double precision      |           |          |
 longitude    | double precision      |           |          |
 location     | character varying(50) |           |          |
Indexes:
    "location_coordinate_pkey" PRIMARY KEY, btree (lc_id)
Referenced by:
    TABLE "crime_location" CONSTRAINT "crime_location_lc_id_fkey" FOREIGN KEY (lc_id) REFERENCES location_coordinate(lc_id)

In [ ]:
dsa_student=> \d location_description
                      Table "myqg3.location_description"
        Column        |         Type          | Collation | Nullable | Default
----------------------+-----------------------+-----------+----------+---------
 ld_id                | integer               |           | not null |
 location_description | character varying(50) |           |          |
Indexes:
    "location_description_pkey" PRIMARY KEY, btree (ld_id)
Referenced by:
    TABLE "crime_location" CONSTRAINT "crime_location_ld_id_fkey" FOREIGN KEY (ld_id) REFERENCES location_description(ld_id)

In [ ]:
dsa_student=> \d crime_location
           Table "myqg3.crime_location"
 Column |  Type   | Collation | Nullable | Default
--------+---------+-----------+----------+---------
 cl_id  | integer |           | not null |
 la_id  | integer |           |          |
 lb_id  | integer |           |          |
 lc_id  | integer |           |          |
 ld_id  | integer |           |          |
Indexes:
    "crime_location_pkey" PRIMARY KEY, btree (cl_id)
Foreign-key constraints:
    "crime_location_la_id_fkey" FOREIGN KEY (la_id) REFERENCES location_area(la_id)
    "crime_location_lb_id_fkey" FOREIGN KEY (lb_id) REFERENCES location_block(lb_id)
    "crime_location_lc_id_fkey" FOREIGN KEY (lc_id) REFERENCES location_coordinate(lc_id)
    "crime_location_ld_id_fkey" FOREIGN KEY (ld_id) REFERENCES location_description(ld_id)
Referenced by:
    TABLE "crime_record" CONSTRAINT "crime_record_cl_id_fkey" FOREIGN KEY (cl_id)REFERENCES crime_location(cl_id)

In [ ]:

dsa_student=> \d crime_record
                         Table "myqg3.crime_record"
   Column    |            Type             | Collation | Nullable | Default
-------------+-----------------------------+-----------+----------+---------
 id          | integer                     |           | not null |
 iucr        | character varying(50)       |           |          |
 fbi_code    | character varying(50)       |           |          |
 cl_id       | integer                     |           |          |
 unnamed_id  | integer                     |           |          |
 case_number | character varying(50)       |           |          |
 arrest      | character varying(10)       |           |          |
 domestic    | character varying(10)       |           |          |
 crime_date  | timestamp without time zone |           |          |
 year        | integer                     |           |          |
 updated_on  | timestamp without time zone |           |          |
Indexes:
    "crime_record_pkey" PRIMARY KEY, btree (id)
Foreign-key constraints:
    "crime_code_pkey" FOREIGN KEY (iucr, fbi_code) REFERENCES crime_code(iucr, fbi_code)
    "crime_record_cl_id_fkey" FOREIGN KEY (cl_id) REFERENCES crime_location(cl_id)

## 2.3 Load the data from the given csv file in Part 1 to the relations

* Assuming there will be multiple relations, you need to extract a subsets of data from the original csv data. As Python may not be your first choice, you can use any languages to create subsets of data. Then store these data into the Module 8 exercises folder. 
* After curating the data use the load loading skillset gained from Module 6
  * Copy and paste your command/query in the following cell or comment on what you have done to populate the data.
  
* Add additional cells if required

## 2.4 For each table, show the table name and number of rows using a sql query

* Add additional cells if required

#Description and no of attributes about the columns has been mentioned above.
#NO of rows are mentioned below for each table.

In [ ]:
%%sql
dsa_student=> SELECT COUNT(*) FROM crime_code;
 count
-------
   319
(1 row)

In [ ]:
dsa_student=> SELECT COUNT(*) FROM location_area;
 count
-------
  1022
(1 row)

In [ ]:
dsa_student=> SELECT COUNT (*) FROM location_block
dsa_student-> ;
 count
-------
 28340
(1 row)

In [ ]:
dsa_student=> SELECT COUNT (*) FROM location_area;
 count
-------
  1022
(1 row)

In [ ]:
dsa_student=> SELECT COUNT(*) FROM location_coordinate;
 count
--------
 162286
(1 row)

In [ ]:
dsa_student=> SELECT COUNT(*) FROM location_description;
 count
-------
    98
(1 row)

In [ ]:
dsa_student=> SELECT COUNT(*) FROM crime_location;
 count
--------
 243416
(1 row)

In [ ]:
dsa_student=> SELECT COUNT(*) FROM crime_record;
 count
--------
 334715
(1 row)

## 2.5 Develop five distinct and useful queries that could be potentially used for policing planning, policy making, citizen awareness, etc.

* Queries should provide some analytic values and use your SQL skillset beyond simple SELECT-FROM-WHERE using multiple tables. I expect to see GROUP BY/HAVING, Nested Queries, Aggregation Operators, etc.
* Each query should have documentation to explain what this query is looking for and why it is meaningful for what purposes.

### Best final projects will be given to three students (two online and one on campus) who will join me for beers at Flat Branch (local brewery in Columbia, Missouri) during the Executive Week in March 2022 (if pandemic situation is OK) or 2023 (I seriously think it should be OK by then). 

* five pairs of cells are expected. Your output presentations have to be self explainable. (hint: use AS)

In [65]:
%%sql
SELECT count(case_number),block
FROM crime_location JOIN location_area USING(la_id) JOIN
crime_record USING(cl_id) JOIN
location_block USING(lb_id)
GROUP BY block
ORDER BY count DESC
LIMIT 10;



 count |                block
-------+-------------------------------------
   661 | 008XX N MICHIGAN AVE
   556 | 0000X W TERMINAL ST
   534 | 001XX N STATE ST
   504 | 076XX S CICERO AVE
   481 | 0000X N STATE ST
   442 | 008XX N STATE ST
   389 | 040XX W LAKE ST
   324 | 064XX S DR MARTIN LUTHER KING JR DR
   272 | 063XX S DR MARTIN LUTHER KING JR DR
   272 | 009XX W BELMONT AVE
(10 rows)

UsageError: Cell magic `%%sql` not found.

In [ ]:
# What is the query trying to achieve - use natural language
It states all the case number according to the block that has been located at most if we group by according to the group by block and order them by count desc

In [67]:
%%sql

SELECT DISTINCT primary_type,location_description,iucr
FROM crime_code JOIN crime_record USING(iucr) JOIN
crime_location USING(cl_id) JOIN
location_description USING(ld_id)
WHERE location_description='RESIDENCE'
LIMIT 10;



        primary_type        | location_description | iucr
----------------------------+----------------------+------
 ASSAULT                    | RESIDENCE            | 553
 THEFT                      | RESIDENCE            | 860
 NARCOTICS                  | RESIDENCE            | 2014
 BATTERY                    | RESIDENCE            | 440
 DECEPTIVE PRACTICE         | RESIDENCE            | 1110
 NARCOTICS                  | RESIDENCE            | 2031
 CRIMINAL DAMAGE            | RESIDENCE            | 1320
 CRIM SEXUAL ASSAULT        | RESIDENCE            | 266
 OFFENSE INVOLVING CHILDREN | RESIDENCE            | 1780
 CRIM SEXUAL ASSAULT        | RESIDENCE            | 274
(10 rows)

UsageError: Cell magic `%%sql` not found.

In [68]:
# What is the query trying to achieve - use natural language
We are trying to get the distinct primary type of crimes and their location descriptuon and based upon their iucr
and if we join them according to the location description that is **RESIDENCE**

In [ ]:
%%sql
SELECT primary_type,case_number,description
FROM crime_code JOIN crime_record USING(iucr)
WHERE primary_type='SEX OFFENSE'
LIMIT 10;



 primary_type | case_number |          description
--------------+-------------+--------------------------------
 SEX OFFENSE  | HZ170962    | AGG CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HZ170983    | SEXUAL EXPLOITATION OF A CHILD
 SEX OFFENSE  | HX326496    | CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HX197298    | AGG CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HY265863    | AGG CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HX263704    | CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HX486003    | CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HY213785    | AGG CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HX217236    | AGG CRIMINAL SEXUAL ABUSE
 SEX OFFENSE  | HX312921    | AGG CRIMINAL SEXUAL ABUSE
(10 rows)

In [ ]:
# What is the query trying to achieve - use natural language
We are selecting the primary type and the case number along with the description and we considered the type of crime as **SEX OFFENCSE** and we saw the top 10 for them

In [ ]:
%%sql

SELECT tbl.block,tbl.description, tbl.count, rank FROM
(
SELECT lb.block,cc.description, COUNT(*) AS count, RANK() OVER(PARTITION by lb.block ORDER BY COUNT(*) DESC) FROM crime_code cc
JOIN crime_record cr ON cr.iucr = cc.iucr AND cr.fbi_code = cc.fbi_code
JOIN crime_location cl ON cl.cl_id = cr.cl_id
JOIN location_block lb ON lb.lb_id = cl.lb_id
GROUP BY lb.block,cc.description
ORDER BY 3 DESC
) AS tbl
WHERE rank<=10
ORDER BY 1,4;



                block                |                         description
                 | count | rank
-------------------------------------+--------------------------------------------
-----------------+-------+------
 0000X E 100TH PL                    | POSS: CANNABIS 30GMS OR LESS
                 |     4 |    1
 0000X E 100TH PL                    | DOMESTIC BATTERY SIMPLE
                 |     3 |    2
 0000X E 100TH PL                    | TELEPHONE THREAT
                 |     1 |    3
 0000X E 100TH PL                    | TO PROPERTY
                 |     1 |    3
 0000X E 100TH PL                    | AUTOMOBILE
                 |     1 |    3
 0000X E 100TH PL                    | POSS: CRACK
                 |     1 |    3
 0000X E 100TH PL                    | STRONGARM - NO WEAPON
                 |     1 |    3
 0000X E 100TH PL                    | SIMPLE
                 |     1 |    3
 0000X E 100TH PL                    | RECKLESS CONDUCT
                 |     1 |    3
 0000X E 100TH ST                    | DOMESTIC BATTERY SIMPLE
                 |     7 |    1
 0000X E 100TH ST                    | FORCIBLE ENTRY
                 |     3 |    2
 0000X E 100TH ST                    | POSS: CANNABIS 30GMS OR LESS
                 |     3 |    2
 0000X E 100TH ST                    | $500 AND UNDER
                 |     2 |    4
 0000X E 100TH ST                    | AUTOMOBILE
                 |     2 |    4
 0000X E 100TH ST                    | ENDANGERING LIFE/HEALTH CHILD
                 |     1 |    6
 0000X E 100TH ST                    | UNLAWFUL POSS OF HANDGUN
                 |     1 |    6
 0000X E 100TH ST                    | AGGRAVATED:KNIFE/CUTTING INSTR
                 |     1 |    6
 0000X E 100TH ST                    | POSS: HALLUCINOGENS
                 |     1 |    6
 0000X E 100TH ST                    | AGG PO HANDS NO/MIN INJURY
                 |     1 |    6
 0000X E 100TH ST                    | SIMPLE
                 |     1 |    6
 0000X E 100TH ST                    | NON-AGGRAVATED
                 |     1 |    6

In [ ]:
# What is the query trying to achieve - use natural language
We are trying to see the description along with count as ranking in accordance to their description

In [69]:
%%sql

dsa_student=> select count(*) as no_of_cases from location_area group by ward
dsa_student-> LIMIT 10;


no_of_cases
-------------
          23
          13
          29
          14
           3
          16
          11
          17
          13
          31
(10 rows)

UsageError: Cell magic `%%sql` not found.

In [ ]:
# What is the query trying to achieve - use natural language
getting the cases per ward by this we query we can analze that which ward is having most cases.

## End of Final Project

# Save your notebook, then `File > Close and Halt`